# Лагода Тимофій
def main():
    filename = "questions.txt"
    try:
        with open(filename, "w") as file:#відкриття файлу
            #запис даних до файлу
            file.write("Студент: Лагода Тимофій\n")
            file.write("Питання: Що таке функція?\n")
        print(f"Файл '{filename}' успішно створено та заповнено.")
    except:
        print("Помилка: файл не знайдено або неможливо створити.")

    # Мізерний Іван
    try:
        with open(filename, "a") as file:#відкриття файлу
            #запис даних до файлу
            file.write("\nСтудент: Мізерний Іван\n")
            file.write("""Відповідь: У Python функції - це іменовані блоки коду, призначені для вирішення однієї конкретної задачі.
Головною перевагою функцій є можливість повторного використання коду.
Функція може приймати будь-яку кількість будь-яких вхідних параметрів і повертати результат у вигляді будь-яких об’єктів.\n""")
            file.write("Питання для наступного студента: Назвіть основні властивості множин в Python.\n")
        print("Файл успішно оновлено (Студент 2).")
    except:
        print("Помилка: файл не знайдено або неможливо створити.")

    # Зякун Владислав
    try:
        with open(filename, "a") as file:#відкриття файлу
            #запис даних до файлу
            file.write("\nСтудент: Зякун Владислав\n")
            file.write("Відповідь: Множина в Python - невпорядкована колекція незмінних, унікальних елементів.\n")
            file.write("Властивості множин:\n")
            file.write(" - усі елементи множини є унікальні, у множині не може бути двох однакових елементів;\n")
            file.write(" - елементи множини є незмінюваними об'єктами;\n")
            file.write(" - елементи множини можуть бути різних типів.\n")
            file.write("\nПитання для наступного студента: Які переваги використання кортежів?\n")
        print("Файл успішно доповнено (Студент 3).")
    except:
        print("Помилка: файл не знайдено або неможливо створити.")
#виклик головної функції
main()